using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TestRabnot.Model
{
    internal class QyeryService
    {
        public static string GetDay(string day)
        {
            string res = day switch
            {
                "ראשון" => "באחד בשבת",
                "שני" => "בשני בשבת",
                "שלישי" => "בשלישי בשבת",
                "רביעי" => "ברביעי בשבת",
                "חמישי" => "בחמישי בשבת",
                "שישי" => "בשישי בשבת",
                _ => string.Empty,

            };
            return res;
        }

        public static string GetDayInMonth(int DayInMonth)
        {
            string res = DayInMonth switch
            {
                1 => "יום אחד לירח",
                2 => "שני ימים לירח",
                3 => "שלושה ימים לירח",
                4 => "ארבעה ימים לירח",
                5 => "חמישה ימים לירח",
                6 => "שישה ימים לירח",
                7 => "שבעה ימים לירח",
                8 => "שמונה ימים לירח",
                9 => "תשעה ימים לירח",
                10 => "עשרה ימים לירח",
                11 => "אחד עשר ימים לירח",
                12 => "שנים עשר ימים לירח",
                13 => "שלושה עשר ימים לירח",
                14 => "ארבעה עשר ימים לירח",
                15 => "חמישה עשר ימים לירח",
                16 => "שישה עשר ימים לירח",
                17 => "שבעה עשר ימים לירח",
                18 => "שמונה עשר ימים לירח",
                19 => "תשעה עשר ימים לירח",
                20 => "עשרים ימים לירח",
                21 => "עשרים ואחת ימים לירח",
                22 => "עשרים ושניים ימים לירח",
                23 => "עשרים ושלושה ימים לירח",
                24 => "עשרים וארבעה ימים לירח",
                25 => "עשרים וחמישה ימים לירח",
                26 => "עשרים ושישה ימים לירח",
                27 => "עשרים ושבעה ימים לירח",
                28 => "עשרים ושמונה ימים לירח",
                29 => "עשרים ותשעה ימים לירח",
                30 => "שלושים ימים לירח"

            };
            return res;
        }

        public static string GetMonth(string Month, int day)
        {
            if (day != 30) return Month;
            string res = Month switch
            {
                "תשרי" => "לחודש תשרי הוא חודש חשוון",
                "חשוון" => "לחודש חשוון הוא חודש כסליו",
                "כסליו" => "לחודש כסליו הוא חודש טבת",
                "טבת" => "לחודש טבת הוא חודש שבט",
                "שבט" => "לחודש שבט הוא חודש אדר א",
                "אדר א" => "לחודש אדר א הוא חודש אדר ב",
                "אדר ב" => "לחודש אדר ב הוא חודש ניסן",
                "ניסן" => "לחודש ניסן הוא חודש אייר",
                "אייר" => "לחודש אייר הוא חודש סיוון",
                "סיוון" => "לחודש סיוון הוא חודש תמוז",
                "תמוז" => "לחודש תמוז הוא חודש אב",
                "אב" => "לחודש אב הוא חודש אלול",
                "אלול" => "לחודש אלול הוא חודש תשרי"

            };
            return res;
        }

        public static string GetYear(string Year)
        {
            string res = Year switch
            {
                "תשפ\"ה" => "בשנת חמשת אלפים ושבע מאות ושמנים וחמישה",
                "תשפ\"ד" => "בשנת חמשת אלפים ושבע מאות ושמנים וארבע",
                "תשפ\"ו" => "בשנת חמשת אלפים ושבע מאות ושמנים ושישה",
                "תשפ\"ז" => "בשנת חמשת אלפים ושבע מאות ושמנים ושבעה",
                "תשפ\"ח" => "בשנת חמשת אלפים ושבע מאות ושמנים ושמונה",
                "תשפ\"ט" => "בשנת חמשת אלפים ושבע מאות ושמנים ותשעה",
                "תש\"צ" => "בשנת חמשת אלפים ושבע מאות ותשעים",
                "תשצ\"א" => "בשנת חמשת אלפים ושבע מאות ותשעים ואחת",
                "תשצ\"ב" => "בשנת חמשת אלפים ושבע מאות ותשעים ושניים",
                "תשצ\"ג" => "בשנת חמשת אלפים ושבע מאות ותשעים ושלושה"

            };
            return res;
        }
    }
}
